# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем 
# первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6]
result = []
n = (len(list) // 2 + 1)
print(n)
    
for i in range(n):
    result.append(list[i] * list[-i-1])
print(result, end= ', ')